---
kind: other
id: Methods.T:Autodesk.Revit.UI.TextEditorOptions
source: html/301fbfda-7c44-4172-3913-534d17bf6f29.htm
---
# TextEditorOptions Methods

Returns the current Revit instance's TextEditorOptions.